src/Reports/РасчетЗатратНаУлучшениеОС/РасчетЗатратНаУлучшениеОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>РасчетЗатратНаУлучшениеОС</name>
  <attributes>
    <name>Отбор</name>
    <type>
      <types>Filter</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСведений</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументИсключения</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьРасшифровкуСуммы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Report>

src/AccountingRegisters/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Хозрасчетный</name>
  <comment>(Регл)</comment>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <dimensions>
    <name>НалоговоеНазначение</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаНУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЖурнала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписаниеПартий</name>
    <comment>Запись сформирована при списании партий</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <comment>Дата формирования проводки регламентной процедурой</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРегламентнойОперации</name>
    <type>
      <types>EnumRef.ВидыРегламентныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетДополнительный</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

src/InformationRegisters/НалоговыеНазначенияОС/НалоговыеНазначенияОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НалоговыеНазначенияОС</name>
  <comment>(Регл)</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НалоговоеНазначение</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/AccountingRegisters/Налоговый/Налоговый.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Налоговый</name>
  <comment>(Регл)</comment>
  <chartOfAccounts>ChartOfAccounts.Налоговый</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Налоговый.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Налоговый.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Налоговый.AccountingFlag.Валютный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Налоговый.ExtDimensionAccountingFlag.Валютный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Налоговый.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Налоговый.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>НомерЖурнала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписаниеПартий</name>
    <comment>Запись сформирована при списании партий</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <comment>Дата формирования проводки регламентной процедурой</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРегламентнойОперации</name>
    <type>
      <types>EnumRef.ВидыРегламентныхОпераций</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

src/InformationRegisters/ПараметрыНалоговогоУчета/ПараметрыНалоговогоУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыНалоговогоУчета</name>
  <comment>(Регл)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>УДАЛИТЬГодовойПроцентОтнесенияНаВРСуммУлучшенияОС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УДАЛИТЬСтатьяВаловыхДоходовПоПереоценкеВалюты</name>
    <type>
      <types>CatalogRef.СтатьиНалоговыхДеклараций</types>
    </type>
  </resources>
  <resources>
    <name>УДАЛИТЬСтатьяВаловыхРасходовПоПереоценкеВалюты</name>
    <type>
      <types>CatalogRef.СтатьиНалоговыхДеклараций</types>
    </type>
  </resources>
  <resources>
    <name>УДАЛИТЬСтатьяПоАмортизацииНМА</name>
    <type>
      <types>CatalogRef.СтатьиНалоговыхДеклараций</types>
    </type>
  </resources>
  <resources>
    <name>УДАЛИТЬСтатьяПриростаУбылиНезавершенногоПроизводства</name>
    <type>
      <types>CatalogRef.СтатьиНалоговыхДеклараций</types>
    </type>
  </resources>
  <resources>
    <name>УДАЛИТЬСтатьяВаловыхРасходовПоУлучшениюОС</name>
    <type>
      <types>CatalogRef.СтатьиНалоговыхДеклараций</types>
    </type>
  </resources>
  <resources>
    <name>УДАЛИТЬРассчитыватьМатериальнуюСоставляющуюПродукцииНЗП</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УДАЛИТЬНормаРасходовНаГарантийныйРемонт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УДАЛИТЬНормаРасходовНаРекламу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УДАЛИТЬНормаРасходовНаСтрахование</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УДАЛИТЬНормаСуточныеБезПитания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УДАЛИТЬНормаСуточныеБезПитанияЗарубеж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УДАЛИТЬНормаСуточныеОдноразовое</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УДАЛИТЬНормаСуточныеОдноразовоеЗарубеж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УДАЛИТЬНормаСуточныеДвухразовое</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УДАЛИТЬНормаСуточныеДвухразовоеЗарубеж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УДАЛИТЬНормаСуточныеТрехразовое</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УДАЛИТЬНормаСуточныеТрехразовоеЗарубеж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УДАЛИТЬНормаРасходовНаГСМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УДАЛИТЬВалютаСуточныеЗарубеж</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ГодовойПроцентОтнесенияНаРасходыСуммУлучшенияОС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаСуточные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаСуточныеЗарубеж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаБюджетНеприбыльные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаПрофсоюзы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаЧернобыльцы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаКультура</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаКинематограф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаИнжиниринг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаКонсалтинг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаРоялти</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаРекламаНерезиденты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

src/Reports/РасчетЗатратНаУлучшениеОС/ObjectModule.bsl
#Если Клиент Тогда
	
Перем ВысотаЗаголовка Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ 
// 

Процедура СформироватьОтчет(ДокументРезультат, ТолькоЗаголовок = Ложь) Экспорт

	ДокументРезультат.Очистить();
	
	Макет     = ПолучитьМакет("Макет");
	НаДату    = ?(НЕ ЗначениеЗаполнено(ДатаСведений), РабочаяДата, ДатаСведений);
	НаДату    = КонецДня(НаДату);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ДатаСведений = Формат(Год(НаДату),"ЧГ=0");
	
	ДокументРезультат.Вывести(ОбластьМакета);
	ВысотаЗаголовка = ДокументРезультат.ВысотаТаблицы;
	
	Если ТолькоЗаголовок Тогда
		
		Возврат
		
	КонецЕсли;
	
	ЗапросСтоимостьБалансовая = Новый Запрос;
	
	Если Год(НаДату) > 2011 Тогда
		УсловиеОрганизация = ?(ЗначениеЗаполнено(Организация), "Организация = &Организация", "");	
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	СУММА(ХозрасчетныйОстатки.СуммаНУОстаток) КАК СтоимостьНачПериода
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(&НачалоПериода, Счет В ИЕРАРХИИ (&Счет10_11), , " + УсловиеОрганизация + ") КАК ХозрасчетныйОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НалоговыеНазначенияОС.СрезПоследних(&НачалоПериода, ) КАК НалоговыеНазначенияОССрезПоследних
		|		ПО ХозрасчетныйОстатки.Субконто1 = НалоговыеНазначенияОССрезПоследних.ОсновноеСредство
		|ГДЕ
		|	НалоговыеНазначенияОССрезПоследних.НалоговоеНазначение <> &НеоблНехоз";
	Иначе	
		УсловиеОрганизация = ?(ЗначениеЗаполнено(Организация), "И Организация = &Организация", "");	
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА НалоговыйОстаткиИОбороты.Счет = &СчетОСО
		|						ИЛИ НалоговыйОстаткиИОбороты.Счет = &СчетОСГ
		|					ТОГДА НалоговыйОстаткиИОбороты.СуммаНачальныйОстатокДт
		|			КОНЕЦ), 0) КАК СтоимостьНачПериода,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА НалоговыйОстаткиИОбороты.Счет = &СчетВР
		|						И НалоговыйОстаткиИОбороты.Субконто2 = &СтатьяМодернизации
		|					ТОГДА НалоговыйОстаткиИОбороты.СуммаОборотДт
		|			КОНЕЦ), 0) КАК ЗатратыНаРемонт
		|ИЗ
		|	РегистрБухгалтерии.Налоговый.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&КонецКвартала1,
		|			Период,
		|			ДвиженияИГраницыПериода,
		|			Счет = &СчетВР
		|				ИЛИ Счет = &СчетОСО
		|				ИЛИ Счет = &СчетОСГ,
		|			,
	 	|			(НЕ Субконто1 = &НеоблВНД) " + УсловиеОрганизация + ") КАК НалоговыйОстаткиИОбороты";
	КонецЕсли;	
	
	ЗапросСтоимостьБалансовая.Текст = ТекстЗапроса;
	
	НачалоПериода 	= НачалоГода(НаДату);
	КонецПериода 	= КонецГода(НаДату);
	
	Если Год(НаДату) > 2011 Тогда
		СписокСчет10_11 = Новый СписокЗначений;
		СписокСчет10_11.Добавить(Планысчетов.Хозрасчетный.ОсновныеСредства);
		СписокСчет10_11.Добавить(Планысчетов.Хозрасчетный.ДругиеНеоборотныеМатериальныеАктивы);
		ЗапросСтоимостьБалансовая.УстановитьПараметр("Счет10_11",	СписокСчет10_11);
		ЗапросСтоимостьБалансовая.УстановитьПараметр("НеоблНехоз", 	Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность);
	Иначе
		СчетОСГ = ПланыСчетов.Налоговый.ОсновныеСредстваУчетПоГруппам;
		СчетОСО = ПланыСчетов.Налоговый.ОсновныеСредстваУчетПоОбъектам;
		ЗапросСтоимостьБалансовая.УстановитьПараметр("СчетОСГ", СчетОСГ);
		ЗапросСтоимостьБалансовая.УстановитьПараметр("СчетОСО", СчетОСО);
		
		СчетВР = ПланыСчетов.Налоговый.ВаловыеРасходы;
		ЗапросСтоимостьБалансовая.УстановитьПараметр("СчетВР", СчетВР);
		
		СтруктураПараметров = Новый Структура("УдалитьСтатьяВаловыхРасходовПоУлучшениюОС");
		СрезПоследнихПараметрыНалоговогоУчета = РегистрыСведений.ПараметрыНалоговогоУчета.СрезПоследних(КонецПериода,СтруктураПараметров);
		СтатьяМодернизации = ?(СрезПоследнихПараметрыНалоговогоУчета.Количество() = 0, 0, СрезПоследнихПараметрыНалоговогоУчета[0].УдалитьСтатьяВаловыхРасходовПоУлучшениюОС);
		
		ЗапросСтоимостьБалансовая.УстановитьПараметр("СтатьяМодернизации", СтатьяМодернизации);
		
		ЗапросСтоимостьБалансовая.УстановитьПараметр("НеоблВНД", Справочники.ВидыНалоговойДеятельности.НеОблагаемая);
		
		КонецКвартала1 = КонецКвартала(НачалоГода(НаДату));
		ЗапросСтоимостьБалансовая.УстановитьПараметр("КонецКвартала1", КонецКвартала1);
		
	КонецЕсли;
	
	ЗапросСтоимостьБалансовая.УстановитьПараметр("Организация", Организация);
	
	ЗапросСтоимостьБалансовая.УстановитьПараметр("НачалоПериода", НачалоПериода);
	
	Если Год(НаДату) > 2011 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("СуммыЗатрат");
	Иначе	
		ОбластьМакета = Макет.ПолучитьОбласть("СуммыЗатрат2011");
	КонецЕсли;	
	
	СтоимостьБалансоваяВыборка = ЗапросСтоимостьБалансовая.Выполнить().Выбрать();
	
	Если СтоимостьБалансоваяВыборка.Следующий() Тогда
		
		СтоимостьНачПериода = ?(СтоимостьБалансоваяВыборка.СтоимостьНачПериода = Null, 0, СтоимостьБалансоваяВыборка.СтоимостьНачПериода);
		ОбластьМакета.Параметры.СтоимостьНачПериода = СтоимостьНачПериода;
		
		СтруктураПараметров = Новый Структура("ГодовойПроцентОтнесенияНаРасходыСуммУлучшенияОС");
		СрезПоследнихПараметрыНалоговогоУчета = РегистрыСведений.ПараметрыНалоговогоУчета.СрезПоследних(КонецПериода,СтруктураПараметров);
		НормаЛимита = ?(СрезПоследнихПараметрыНалоговогоУчета.Количество() = 0, 0, СрезПоследнихПараметрыНалоговогоУчета[0].ГодовойПроцентОтнесенияНаРасходыСуммУлучшенияОС);
		
		СуммаЛимита = СтоимостьНачПериода * НормаЛимита / 100;
		
		СуммаЗатратНаРемонт1кв2011 = 0;
		
		Если Год(НаДату) = 2011 Тогда
			СуммаЗатратНаРемонт1кв2011 = ?(СтоимостьБалансоваяВыборка.ЗатратыНаРемонт = Null, 0, СтоимостьБалансоваяВыборка.ЗатратыНаРемонт);
			
			ОбластьМакета.Параметры.СуммаЗатратНаРемонт1кв2011 = СуммаЗатратНаРемонт1кв2011;
		КонецЕсли;	
		
		СуммаЛимита = Макс(0, СуммаЛимита - СуммаЗатратНаРемонт1кв2011);	
		ОбластьМакета.Параметры.СуммаЛимита = СуммаЛимита;
		
	Иначе
		
		ОбластьМакета.Параметры.СтоимостьНачПериода = 0;
		ОбластьМакета.Параметры.СуммаЛимита = 0;
		
	КонецЕсли;
	
	Выборка = ЗаполнитьНачальныеНастройки();
	Если Выборка.Следующий() Тогда
		ОбластьМакета.Параметры.СуммаОтнесенная = Выборка.Сумма;
		ОбластьМакета.Параметры.СуммаОставшаяся = ОбластьМакета.Параметры.СуммаЛимита - Выборка.Сумма;
	Иначе 
		ОбластьМакета.Параметры.СуммаОтнесенная = 0;
		ОбластьМакета.Параметры.СуммаОставшаяся = ОбластьМакета.Параметры.СуммаЛимита;
	КонецЕсли;
	
	ДокументРезультат.Вывести(ОбластьМакета);
	
	Если ВыводитьРасшифровкуСуммы Тогда
		ОбластьРасшифровкаЗаголовок = Макет.ПолучитьОбласть("РасшифровкаЗаголовок");
		ВыводитьРасшифровкаЗаголовок = Истина;
	Иначе
		Возврат;
	КонецЕсли;
			
	Пока Выборка.Следующий() Цикл
		Если ВыводитьРасшифровкаЗаголовок Тогда
			ДокументРезультат.Вывести(ОбластьРасшифровкаЗаголовок);
			ВыводитьРасшифровкаЗаголовок = Ложь;
		КонецЕсли;
		СтрокаМакета = Макет.ПолучитьОбласть("Строка");
		СтрокаМакета.Параметры.Заполнить(Выборка);
		ДокументРезультат.Вывести(СтрокаМакета);

	КонецЦикла;
	
	ДокументРезультат.ЗакончитьАвтогруппировкуСтрок();
	ДокументРезультат.ТолькоПросмотр                = Истина;
	ДокументРезультат.ВерхнийКолонтитул.Выводить    = Истина;
	ДокументРезультат.НижнийКолонтитул.Выводить     = Истина;
	ДокументРезультат.ОбластьПечати = ДокументРезультат.Область(1, 2, ДокументРезультат.ВысотаТаблицы,
																	  ДокументРезультат.ШиринаТаблицы);
	ДокументРезультат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РасчетЗатратНаУлучшениеОС";
	
КонецПроцедуры // СформироватьОтчет()
																									
// Процедура - заполняет начальные настройки заполнения
//
Функция ЗаполнитьНачальныеНастройки() Экспорт
	
	УсловиеРегистратор = ?(ЗначениеЗаполнено(ДокументИсключения),"И ХозрасчетныйОстаткиИОбороты.Регистратор <> &Регистратор", "");	
	УсловиеОрганизация = ?(ЗначениеЗаполнено(Организация)		,"И ХозрасчетныйОстаткиИОбороты.Организация = &Организация", "");	
	
	Запрос = новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатьиЗатрат.Ссылка КАК СтатьяЗатрат
	|ПОМЕСТИТЬ СтатьиЗатратСписок
	|ИЗ
	|	Справочник.СтатьиЗатрат КАК СтатьиЗатрат
	|ГДЕ
	|	СтатьиЗатрат.СтатьяДекларацииПоНалогуНаПрибыль В(&СтатьиДекларации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОстаткиИОбороты.Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(ХозрасчетныйОстаткиИОбороты.Регистратор) КАК ПредставлениеРегистратор,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНУОборот КАК Сумма
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, Движения, Счет В ИЕРАРХИИ (&СчетаЗатрат), , ) КАК ХозрасчетныйОстаткиИОбороты
	|ГДЕ
	|	ХозрасчетныйОстаткиИОбороты.Субконто1 В
	|					(ВЫБРАТЬ
	|						СтатьиЗатратСписок.СтатьяЗатрат
	|					ИЗ
	|						СтатьиЗатратСписок КАК СтатьиЗатратСписок)
	|	" + УсловиеОрганизация + "
	|	" + УсловиеРегистратор + "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОстаткиИОбороты.Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(ХозрасчетныйОстаткиИОбороты.Регистратор),
	|	ХозрасчетныйОстаткиИОбороты.СуммаНУОборот
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, Движения, Счет В ИЕРАРХИИ (&СчетаЗатрат), , ) КАК ХозрасчетныйОстаткиИОбороты
	|ГДЕ
	|	ХозрасчетныйОстаткиИОбороты.Субконто2 В	
	|					(ВЫБРАТЬ
	|						СтатьиЗатратСписок.СтатьяЗатрат
	|					ИЗ
	|						СтатьиЗатратСписок КАК СтатьиЗатратСписок)
	|	" + УсловиеОрганизация + "
	|   " + УсловиеРегистратор + "
	|   ИТОГИ
	|   СУММА(Сумма)
	|ПО
	|   ОБЩИЕ";
	СчетаЗатрат = новый СписокЗначений;
	
	СчетаЗатрат.Добавить(ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы);
	СчетаЗатрат.Добавить(ПланыСчетов.Хозрасчетный.АдминистративныеРасходы);
	СчетаЗатрат.Добавить(ПланыСчетов.Хозрасчетный.РасходыНаСбыт);
	СчетаЗатрат.Добавить(ПланыСчетов.Хозрасчетный.ДругиеЗатратыОперационнойДеятельности);
	
	Запрос.УстановитьПараметр("СчетаЗатрат", СчетаЗатрат);
	
	СтатьиДекларации = новый СписокЗначений;
	
	СтатьиДекларации.Добавить(Справочники.СтатьиНалоговыхДеклараций.НПНК_АМ_Ремонт_ЗВ);
	СтатьиДекларации.Добавить(Справочники.СтатьиНалоговыхДеклараций.НПНК_АМ_Ремонт_АВ);
	СтатьиДекларации.Добавить(Справочники.СтатьиНалоговыхДеклараций.НПНК_АМ_Ремонт_ВЗ);
	СтатьиДекларации.Добавить(Справочники.СтатьиНалоговыхДеклараций.НПНК_АМ_Ремонт_ИВ);
	
	Запрос.УстановитьПараметр("СтатьиДекларации", СтатьиДекларации);
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ДатаСведений));
	Запрос.УстановитьПараметр("КонецПериода",  КонецГода(ДатаСведений));
	
	Запрос.УстановитьПараметр("Регистратор", ДокументИсключения);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Возврат Запрос.Выполнить().Выбрать();
	
	
КонецФункции // ЗаполнитьНачальныеНастройки()


Процедура Настроить(ДокументРегистратор) Экспорт
	
	ДокументИсключения  = ДокументРегистратор;
	ДатаСведений 		= ДокументИсключения.Дата;
	Организация  		= ДокументИсключения.Организация
	
КонецПроцедуры
#КонецЕсли
